{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "I-Rating",
    "1": "I-Location",
    "2": "B-Rating",
    "3": "I-Restaurant_Name",
    "4": "I-Hours",
    "5": "O",
    "6": "B-Price",
    "7": "I-Dish",
    "8": "I-Cuisine",
    "9": "B-Cuisine",
    "10": "B-Hours",
    "11": "B-Restaurant_Name",
    "12": "B-Dish",
    "13": "B-Location",
    "14": "I-Price",
    "15": "I-Amenity",
    "16": "B-Amenity"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-Amenity": 16,
    "B-Cuisine": 9,
    "B-Dish": 12,
    "B-Hours": 10,
    "B-Location": 13,
    "B-Price": 6,
    "B-Rating": 2,
    "B-Restaurant_Name": 11,
    "I-Amenity": 15,
    "I-Cuisine": 8,
    "I-Dish": 7,
    "I-Hours": 4,
    "I-Location": 1,
    "I-Price": 14,
    "I-Rating": 0,
    "I-Restaurant_Name": 3,
    "O": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.3",
  "vocab_size": 30522
}
